AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/mcu/apollo/regs/am_reg_mcuctrl.h
//*****************************************************************************
//
//  am_reg_mcuctrl.h
//! @file
//!
//! @brief Register macros for the MCUCTRL module
//
//*****************************************************************************

//*****************************************************************************
//
// ${copyright}
//
// This is part of revision ${version} of the AmbiqSuite Development Package.
//
//*****************************************************************************
#ifndef AM_REG_MCUCTRL_H
#define AM_REG_MCUCTRL_H

//*****************************************************************************
//
//! @brief MCUCTRL
//! Instance finder. (1 instance(s) available)
//
//*****************************************************************************
#define AM_REG_MCUCTRL_NUM_MODULES                   1
#define AM_REG_MCUCTRLn(n) \
    (REG_MCUCTRL_BASEADDR + 0x00000000 * n)
//*****************************************************************************
//
// Register offsets.
//
//*****************************************************************************
#define AM_REG_MCUCTRL_CHIP_INFO_O                   0x00000000
#define AM_REG_MCUCTRL_CHIPID0_O                     0x00000004
#define AM_REG_MCUCTRL_CHIPID1_O                     0x00000008
#define AM_REG_MCUCTRL_CHIPREV_O                     0x0000000C
#define AM_REG_MCUCTRL_SUPPLYSRC_O                   0x00000010
#define AM_REG_MCUCTRL_SUPPLYSTATUS_O                0x00000014
// #### INTERNAL BEGIN ####
#ifdef MCU_VALIDATION
#define AM_REG_MCUCTRL_CCRG_O                        0x00000020
#define AM_REG_MCUCTRL_VREFGEN_O                     0x00000040
#define AM_REG_MCUCTRL_BUCK_O                        0x00000060
#define AM_REG_MCUCTRL_BUCK2_O                       0x00000064
#define AM_REG_MCUCTRL_LDOREG1_O                     0x00000080
#define AM_REG_MCUCTRL_LDOREG2_O                     0x00000084
#define AM_REG_MCUCTRL_LDOREG3_O                     0x00000088
#define AM_REG_MCUCTRL_UNCALVREF_O                   0x000000A0
#define AM_REG_MCUCTRL_HFRC_O                        0x000000C0
#define AM_REG_MCUCTRL_LFRC_O                        0x000000E0
#define AM_REG_MCUCTRL_IOCTRL_O                      0x000000E4
#endif // MCU_VALIDATION
// #### INTERNAL END ####
#define AM_REG_MCUCTRL_BANDGAPEN_O                   0x000000FC
// #### INTERNAL BEGIN ####
#ifdef MCU_VALIDATION
#define AM_REG_MCUCTRL_TEMPSCTRL_O                   0x00000100
#define AM_REG_MCUCTRL_ADCPWRDLY_O                   0x00000108
#define AM_REG_MCUCTRL_ADCTSBGPWD_O                  0x0000010C
#define AM_REG_MCUCTRL_XTALCTRL_O                    0x00000120
#endif // MCU_VALIDATION
// #### INTERNAL END ####
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_O              0x00000140
#define AM_REG_MCUCTRL_SRAMPWRDIS_O                  0x00000144
#define AM_REG_MCUCTRL_FLASHPWRDIS_O                 0x00000148
// #### INTERNAL BEGIN ####
#ifdef MCU_VALIDATION
#define AM_REG_MCUCTRL_PWRONRSTDLY_O                 0x00000180
#define AM_REG_MCUCTRL_PWRSEQ1ANA_O                  0x00000184
#define AM_REG_MCUCTRL_PWRSEQ2ANA_O                  0x00000188
#define AM_REG_MCUCTRL_PWRSEQ3ANA_O                  0x0000018C
#endif // MCU_VALIDATION
#define AM_REG_MCUCTRL_BOOTLOADERLOW_O               0x000001A0
#define AM_REG_MCUCTRL_SHADOWVALID_O                 0x000001A4
// #### INTERNAL END ####
#define AM_REG_MCUCTRL_ICODEFAULTADDR_O              0x000001C0
#define AM_REG_MCUCTRL_DCODEFAULTADDR_O              0x000001C4
#define AM_REG_MCUCTRL_SYSFAULTADDR_O                0x000001C8
#define AM_REG_MCUCTRL_FAULTSTATUS_O                 0x000001CC
#define AM_REG_MCUCTRL_FAULTCAPTUREEN_O              0x000001D0
// #### INTERNAL BEGIN ####
#ifdef MCU_VALIDATION
#define AM_REG_MCUCTRL_PMUENABLE_O                   0x00000220
#endif // MCU_VALIDATION
// #### INTERNAL END ####
#define AM_REG_MCUCTRL_TPIUCTRL_O                    0x00000250

//*****************************************************************************
//
// MCUCTRL_CHIP_INFO - Chip Information Register
//
//*****************************************************************************
// Device class.
#define AM_REG_MCUCTRL_CHIP_INFO_CLASS_S             24
#define AM_REG_MCUCTRL_CHIP_INFO_CLASS_M             0xFF000000
#define AM_REG_MCUCTRL_CHIP_INFO_CLASS(n)            (((uint32_t)(n) << 24) & 0xFF000000)
#define AM_REG_MCUCTRL_CHIP_INFO_CLASS_APOLLO        0x01000000

// Device flash size.
#define AM_REG_MCUCTRL_CHIP_INFO_FLASH_S             20
#define AM_REG_MCUCTRL_CHIP_INFO_FLASH_M             0x00F00000
#define AM_REG_MCUCTRL_CHIP_INFO_FLASH(n)            (((uint32_t)(n) << 20) & 0x00F00000)
#define AM_REG_MCUCTRL_CHIP_INFO_FLASH_256K          0x00300000
#define AM_REG_MCUCTRL_CHIP_INFO_FLASH_512K          0x00400000

// Device RAM size.
#define AM_REG_MCUCTRL_CHIP_INFO_RAM_S               16
#define AM_REG_MCUCTRL_CHIP_INFO_RAM_M               0x000F0000
#define AM_REG_MCUCTRL_CHIP_INFO_RAM(n)              (((uint32_t)(n) << 16) & 0x000F0000)
#define AM_REG_MCUCTRL_CHIP_INFO_RAM_32K             0x00000000
#define AM_REG_MCUCTRL_CHIP_INFO_RAM_64K             0x00010000

// Major device revision number.
#define AM_REG_MCUCTRL_CHIP_INFO_MAJORREV_S          12
#define AM_REG_MCUCTRL_CHIP_INFO_MAJORREV_M          0x0000F000
#define AM_REG_MCUCTRL_CHIP_INFO_MAJORREV(n)         (((uint32_t)(n) << 12) & 0x0000F000)

// Minor device revision number.
#define AM_REG_MCUCTRL_CHIP_INFO_MINORREV_S          8
#define AM_REG_MCUCTRL_CHIP_INFO_MINORREV_M          0x00000F00
#define AM_REG_MCUCTRL_CHIP_INFO_MINORREV(n)         (((uint32_t)(n) << 8) & 0x00000F00)

// Device package type.
#define AM_REG_MCUCTRL_CHIP_INFO_PKG_S               6
#define AM_REG_MCUCTRL_CHIP_INFO_PKG_M               0x000000C0
#define AM_REG_MCUCTRL_CHIP_INFO_PKG(n)              (((uint32_t)(n) << 6) & 0x000000C0)
#define AM_REG_MCUCTRL_CHIP_INFO_PKG_BGA             0x00000080
#define AM_REG_MCUCTRL_CHIP_INFO_PKG_CSP             0x000000C0

