AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/mcu/apollo/regs/am_reg_mcuctrl.h
// Number of pins.
#define AM_REG_MCUCTRL_CHIP_INFO_PINS_S              3
#define AM_REG_MCUCTRL_CHIP_INFO_PINS_M              0x00000038
#define AM_REG_MCUCTRL_CHIP_INFO_PINS(n)             (((uint32_t)(n) << 3) & 0x00000038)
#define AM_REG_MCUCTRL_CHIP_INFO_PINS_41PINS         0x00000008
#define AM_REG_MCUCTRL_CHIP_INFO_PINS_64PINS         0x00000008

// Device temperature range.
#define AM_REG_MCUCTRL_CHIP_INFO_TEMP_S              1
#define AM_REG_MCUCTRL_CHIP_INFO_TEMP_M              0x00000006
#define AM_REG_MCUCTRL_CHIP_INFO_TEMP(n)             (((uint32_t)(n) << 1) & 0x00000006)
#define AM_REG_MCUCTRL_CHIP_INFO_TEMP_COMMERCIAL     0x00000000

// Device qualified.
#define AM_REG_MCUCTRL_CHIP_INFO_QUAL_S              0
#define AM_REG_MCUCTRL_CHIP_INFO_QUAL_M              0x00000001
#define AM_REG_MCUCTRL_CHIP_INFO_QUAL(n)             (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_MCUCTRL_CHIP_INFO_QUAL_PROTOTYPE      0x00000000
#define AM_REG_MCUCTRL_CHIP_INFO_QUAL_QUALIFIED      0x00000001

//*****************************************************************************
//
// MCUCTRL_CHIPID0 - Unique Chip ID 0
//
//*****************************************************************************
// Unique chip ID 0.
#define AM_REG_MCUCTRL_CHIPID0_VALUE_S               0
#define AM_REG_MCUCTRL_CHIPID0_VALUE_M               0xFFFFFFFF
#define AM_REG_MCUCTRL_CHIPID0_VALUE(n)              (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_MCUCTRL_CHIPID0_VALUE_APOLLO          0x00000000

//*****************************************************************************
//
// MCUCTRL_CHIPID1 - Unique Chip ID 1
//
//*****************************************************************************
// Unique chip ID 1.
#define AM_REG_MCUCTRL_CHIPID1_VALUE_S               0
#define AM_REG_MCUCTRL_CHIPID1_VALUE_M               0xFFFFFFFF
#define AM_REG_MCUCTRL_CHIPID1_VALUE(n)              (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_MCUCTRL_CHIPID1_VALUE_APOLLO          0x00000000

//*****************************************************************************
//
// MCUCTRL_CHIPREV - Chip Revision
//
//*****************************************************************************
// Chip Revision Number.
#define AM_REG_MCUCTRL_CHIPREV_REVISION_S            0
#define AM_REG_MCUCTRL_CHIPREV_REVISION_M            0x000000FF
#define AM_REG_MCUCTRL_CHIPREV_REVISION(n)           (((uint32_t)(n) << 0) & 0x000000FF)
#define AM_REG_MCUCTRL_CHIPREV_REVISION_APOLLO       0x00000000

//*****************************************************************************
//
// MCUCTRL_SUPPLYSRC - Memory and Core Voltage Supply Source Select Register
//
//*****************************************************************************
// Enables and Selects the Core Buck as the supply for the low-voltage power
// domain.
#define AM_REG_MCUCTRL_SUPPLYSRC_COREBUCKEN_S        1
#define AM_REG_MCUCTRL_SUPPLYSRC_COREBUCKEN_M        0x00000002
#define AM_REG_MCUCTRL_SUPPLYSRC_COREBUCKEN(n)       (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_MCUCTRL_SUPPLYSRC_COREBUCKEN_EN       0x00000002

// Enables and select the Memory Buck as the supply for the Flash and SRAM power
// domain.
#define AM_REG_MCUCTRL_SUPPLYSRC_MEMBUCKEN_S         0
#define AM_REG_MCUCTRL_SUPPLYSRC_MEMBUCKEN_M         0x00000001
#define AM_REG_MCUCTRL_SUPPLYSRC_MEMBUCKEN(n)        (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_MCUCTRL_SUPPLYSRC_MEMBUCKEN_EN        0x00000001

//*****************************************************************************
//
// MCUCTRL_SUPPLYSTATUS - Memory and Core Voltage Supply Source Status Register
//
//*****************************************************************************
// Indicates whether the Core low-voltage domain is supplied from the LDO or the
// Buck.
#define AM_REG_MCUCTRL_SUPPLYSTATUS_COREBUCKON_S     1
#define AM_REG_MCUCTRL_SUPPLYSTATUS_COREBUCKON_M     0x00000002
#define AM_REG_MCUCTRL_SUPPLYSTATUS_COREBUCKON(n)    (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_MCUCTRL_SUPPLYSTATUS_COREBUCKON_LDO   0x00000000
#define AM_REG_MCUCTRL_SUPPLYSTATUS_COREBUCKON_BUCK  0x00000002

// Indicate whether the Memory power domain is supplied from the LDO or the
// Buck.
#define AM_REG_MCUCTRL_SUPPLYSTATUS_MEMBUCKON_S      0
#define AM_REG_MCUCTRL_SUPPLYSTATUS_MEMBUCKON_M      0x00000001
#define AM_REG_MCUCTRL_SUPPLYSTATUS_MEMBUCKON(n)     (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_MCUCTRL_SUPPLYSTATUS_MEMBUCKON_LDO    0x00000000
#define AM_REG_MCUCTRL_SUPPLYSTATUS_MEMBUCKON_BUCK   0x00000001

// #### INTERNAL BEGIN ####
#ifdef MCU_VALIDATION
//*****************************************************************************
//
// MCUCTRL_CCRG - Calibrated Current Reference Generator Control
//
//*****************************************************************************
// Set the CCRG trim.
#define AM_REG_MCUCTRL_CCRG_CCRGTRIM_S               1
#define AM_REG_MCUCTRL_CCRG_CCRGTRIM_M               0x000001FE
#define AM_REG_MCUCTRL_CCRG_CCRGTRIM(n)              (((uint32_t)(n) << 1) & 0x000001FE)
#define AM_REG_MCUCTRL_CCRG_CCRGTRIM_TRIM_EN         0x00000002

// Power down the CCRG.
#define AM_REG_MCUCTRL_CCRG_CCRGPWD_S                0
#define AM_REG_MCUCTRL_CCRG_CCRGPWD_M                0x00000001
#define AM_REG_MCUCTRL_CCRG_CCRGPWD(n)               (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_MCUCTRL_CCRG_CCRGPWD_PWR_DN           0x00000001

#endif // MCU_VALIDATION
// #### INTERNAL END ####
// #### INTERNAL BEGIN ####
#ifdef MCU_VALIDATION
//*****************************************************************************
//
// MCUCTRL_VREFGEN - Voltage Reference Generator Control
//
//*****************************************************************************
// Power Down, Calibrated Voltage Reference Generator.
#define AM_REG_MCUCTRL_VREFGEN_PWDCVREF_S            12
#define AM_REG_MCUCTRL_VREFGEN_PWDCVREF_M            0x00001000
#define AM_REG_MCUCTRL_VREFGEN_PWDCVREF(n)           (((uint32_t)(n) << 12) & 0x00001000)
#define AM_REG_MCUCTRL_VREFGEN_PWDCVREF_PWR_DN       0x00001000

