AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/mcu/apollo/regs/am_reg_mcuctrl.h
// Calibrated Voltage Reference Generator VREF high adjust.
#define AM_REG_MCUCTRL_VREFGEN_CVREFHADJ_S           7
#define AM_REG_MCUCTRL_VREFGEN_CVREFHADJ_M           0x00000F80
#define AM_REG_MCUCTRL_VREFGEN_CVREFHADJ(n)          (((uint32_t)(n) << 7) & 0x00000F80)

// Calibrated Voltage Reference Generator VREF low adjust.
#define AM_REG_MCUCTRL_VREFGEN_CVREFLADJ_S           4
#define AM_REG_MCUCTRL_VREFGEN_CVREFLADJ_M           0x00000070
#define AM_REG_MCUCTRL_VREFGEN_CVREFLADJ(n)          (((uint32_t)(n) << 4) & 0x00000070)

// Calibrated Voltage Reference Generator tc trim (bottom transistor)
#define AM_REG_MCUCTRL_VREFGEN_CVREFBTRIM_S          0
#define AM_REG_MCUCTRL_VREFGEN_CVREFBTRIM_M          0x0000000F
#define AM_REG_MCUCTRL_VREFGEN_CVREFBTRIM(n)         (((uint32_t)(n) << 0) & 0x0000000F)

#endif // MCU_VALIDATION
// #### INTERNAL END ####
// #### INTERNAL BEGIN ####
#ifdef MCU_VALIDATION
//*****************************************************************************
//
// MCUCTRL_BUCK - Analog Buck Control
//
//*****************************************************************************
// Memory Buck Bypass.
#define AM_REG_MCUCTRL_BUCK_BYPBUCKMEM_S             5
#define AM_REG_MCUCTRL_BUCK_BYPBUCKMEM_M             0x00000020
#define AM_REG_MCUCTRL_BUCK_BYPBUCKMEM(n)            (((uint32_t)(n) << 5) & 0x00000020)
#define AM_REG_MCUCTRL_BUCK_BYPBUCKMEM_BYPASS        0x00000020

// Memory buck Enable.
#define AM_REG_MCUCTRL_BUCK_ENBUCKMEM_S              4
#define AM_REG_MCUCTRL_BUCK_ENBUCKMEM_M              0x00000010
#define AM_REG_MCUCTRL_BUCK_ENBUCKMEM(n)             (((uint32_t)(n) << 4) & 0x00000010)
#define AM_REG_MCUCTRL_BUCK_ENBUCKMEM_EN             0x00000010

// Analog buck sleep.
#define AM_REG_MCUCTRL_BUCK_SLEEPBUCKANA_S           3
#define AM_REG_MCUCTRL_BUCK_SLEEPBUCKANA_M           0x00000008
#define AM_REG_MCUCTRL_BUCK_SLEEPBUCKANA(n)          (((uint32_t)(n) << 3) & 0x00000008)
#define AM_REG_MCUCTRL_BUCK_SLEEPBUCKANA_SLEEP       0x00000008

// Core buck enable.
#define AM_REG_MCUCTRL_BUCK_ENBUCKCORE_S             2
#define AM_REG_MCUCTRL_BUCK_ENBUCKCORE_M             0x00000004
#define AM_REG_MCUCTRL_BUCK_ENBUCKCORE(n)            (((uint32_t)(n) << 2) & 0x00000004)
#define AM_REG_MCUCTRL_BUCK_ENBUCKCORE_EN            0x00000004

// Core buck bypass.
#define AM_REG_MCUCTRL_BUCK_BYPBUCKCORE_S            1
#define AM_REG_MCUCTRL_BUCK_BYPBUCKCORE_M            0x00000002
#define AM_REG_MCUCTRL_BUCK_BYPBUCKCORE(n)           (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_MCUCTRL_BUCK_BYPBUCKCORE_BYPASS       0x00000002

// Buck Register Software Override Enable.
#define AM_REG_MCUCTRL_BUCK_BUCKSWE_S                0
#define AM_REG_MCUCTRL_BUCK_BUCKSWE_M                0x00000001
#define AM_REG_MCUCTRL_BUCK_BUCKSWE(n)               (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_MCUCTRL_BUCK_BUCKSWE_OVERRIDE_DIS     0x00000000
#define AM_REG_MCUCTRL_BUCK_BUCKSWE_OVERRIDE_EN      0x00000001

#endif // MCU_VALIDATION
// #### INTERNAL END ####
// #### INTERNAL BEGIN ####
#ifdef MCU_VALIDATION
//*****************************************************************************
//
// MCUCTRL_BUCK2 - Buck Control Reg2
//
//*****************************************************************************
// Enable/disable hysteresis on core buck converters internal comparators.
#define AM_REG_MCUCTRL_BUCK2_BUCKLFCLKSEL_S          10
#define AM_REG_MCUCTRL_BUCK2_BUCKLFCLKSEL_M          0x00000C00
#define AM_REG_MCUCTRL_BUCK2_BUCKLFCLKSEL(n)         (((uint32_t)(n) << 10) & 0x00000C00)

// Enable/disable hysteresis on core buck converters internal comparators.
#define AM_REG_MCUCTRL_BUCK2_HYSTBUCKCORE_S          9
#define AM_REG_MCUCTRL_BUCK2_HYSTBUCKCORE_M          0x00000200
#define AM_REG_MCUCTRL_BUCK2_HYSTBUCKCORE(n)         (((uint32_t)(n) << 9) & 0x00000200)
#define AM_REG_MCUCTRL_BUCK2_HYSTBUCKCORE_DIS        0x00000000
#define AM_REG_MCUCTRL_BUCK2_HYSTBUCKCORE_EN         0x00000200

// Enable/disable hysteresis on memory buck converters internal comparators.
#define AM_REG_MCUCTRL_BUCK2_HYSTBUCKMEM_S           8
#define AM_REG_MCUCTRL_BUCK2_HYSTBUCKMEM_M           0x00000100
#define AM_REG_MCUCTRL_BUCK2_HYSTBUCKMEM(n)          (((uint32_t)(n) << 8) & 0x00000100)
#define AM_REG_MCUCTRL_BUCK2_HYSTBUCKMEM_DIS         0x00000000
#define AM_REG_MCUCTRL_BUCK2_HYSTBUCKMEM_EN          0x00000100

// Flash Buck Time On Select
#define AM_REG_MCUCTRL_BUCK2_BMEMTONSEL_S            4
#define AM_REG_MCUCTRL_BUCK2_BMEMTONSEL_M            0x000000F0
#define AM_REG_MCUCTRL_BUCK2_BMEMTONSEL(n)           (((uint32_t)(n) << 4) & 0x000000F0)

// Core Buck Time On Select
#define AM_REG_MCUCTRL_BUCK2_BCORETONSEL_S           0
#define AM_REG_MCUCTRL_BUCK2_BCORETONSEL_M           0x0000000F
#define AM_REG_MCUCTRL_BUCK2_BCORETONSEL(n)          (((uint32_t)(n) << 0) & 0x0000000F)

#endif // MCU_VALIDATION
// #### INTERNAL END ####
// #### INTERNAL BEGIN ####
#ifdef MCU_VALIDATION
//*****************************************************************************
//
// MCUCTRL_LDOREG1 - Analog LDO Reg 1
//
//*****************************************************************************
// CORE LDO Trim R3.
#define AM_REG_MCUCTRL_LDOREG1_TRIMCORELDOR3_S       19
#define AM_REG_MCUCTRL_LDOREG1_TRIMCORELDOR3_M       0x03F80000
#define AM_REG_MCUCTRL_LDOREG1_TRIMCORELDOR3(n)      (((uint32_t)(n) << 19) & 0x03F80000)

// CORE LDO Trim R2.
#define AM_REG_MCUCTRL_LDOREG1_TRIMCORELDOR2_S       9
#define AM_REG_MCUCTRL_LDOREG1_TRIMCORELDOR2_M       0x0007FE00
#define AM_REG_MCUCTRL_LDOREG1_TRIMCORELDOR2(n)      (((uint32_t)(n) << 9) & 0x0007FE00)

// CORE LDO Trim R1.
#define AM_REG_MCUCTRL_LDOREG1_TRIMCORELDOR1_S       0
#define AM_REG_MCUCTRL_LDOREG1_TRIMCORELDOR1_M       0x000001FF
#define AM_REG_MCUCTRL_LDOREG1_TRIMCORELDOR1(n)      (((uint32_t)(n) << 0) & 0x000001FF)

#endif // MCU_VALIDATION
// #### INTERNAL END ####
// #### INTERNAL BEGIN ####
#ifdef MCU_VALIDATION
//*****************************************************************************
//
// MCUCTRL_LDOREG2 - LDO Control Register 2
//
//*****************************************************************************
// Analog LDO Power Down.
#define AM_REG_MCUCTRL_LDOREG2_PWDANALDO_S           22
#define AM_REG_MCUCTRL_LDOREG2_PWDANALDO_M           0x00400000
#define AM_REG_MCUCTRL_LDOREG2_PWDANALDO(n)          (((uint32_t)(n) << 22) & 0x00400000)
#define AM_REG_MCUCTRL_LDOREG2_PWDANALDO_PWR_DN      0x00400000

// FLASH LDO Power Down.
#define AM_REG_MCUCTRL_LDOREG2_PWDMEMLDO_S           21
#define AM_REG_MCUCTRL_LDOREG2_PWDMEMLDO_M           0x00200000
#define AM_REG_MCUCTRL_LDOREG2_PWDMEMLDO(n)          (((uint32_t)(n) << 21) & 0x00200000)
#define AM_REG_MCUCTRL_LDOREG2_PWDMEMLDO_PWR_DN      0x00200000

// CORE LDO Power Down.
#define AM_REG_MCUCTRL_LDOREG2_PWDCORELDO_S          20
#define AM_REG_MCUCTRL_LDOREG2_PWDCORELDO_M          0x00100000
#define AM_REG_MCUCTRL_LDOREG2_PWDCORELDO(n)         (((uint32_t)(n) << 20) & 0x00100000)
#define AM_REG_MCUCTRL_LDOREG2_PWDCORELDO_PWR_DN     0x00100000

