AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/mcu/apollo/regs/am_reg_mcuctrl.h
// Analog LDO Sleep.
#define AM_REG_MCUCTRL_LDOREG2_SLEEPANALDO_S         19
#define AM_REG_MCUCTRL_LDOREG2_SLEEPANALDO_M         0x00080000
#define AM_REG_MCUCTRL_LDOREG2_SLEEPANALDO(n)        (((uint32_t)(n) << 19) & 0x00080000)
#define AM_REG_MCUCTRL_LDOREG2_SLEEPANALDO_SLEEP     0x00080000

// FLASH LDO Sleep.
#define AM_REG_MCUCTRL_LDOREG2_SLEEPMEMLDO_S         18
#define AM_REG_MCUCTRL_LDOREG2_SLEEPMEMLDO_M         0x00040000
#define AM_REG_MCUCTRL_LDOREG2_SLEEPMEMLDO(n)        (((uint32_t)(n) << 18) & 0x00040000)
#define AM_REG_MCUCTRL_LDOREG2_SLEEPMEMLDO_SLEEP     0x00040000

// CORE LDO Sleep.
#define AM_REG_MCUCTRL_LDOREG2_SLEEPCORELDO_S        17
#define AM_REG_MCUCTRL_LDOREG2_SLEEPCORELDO_M        0x00020000
#define AM_REG_MCUCTRL_LDOREG2_SLEEPCORELDO(n)       (((uint32_t)(n) << 17) & 0x00020000)
#define AM_REG_MCUCTRL_LDOREG2_SLEEPCORELDO_SLEEP    0x00020000

// Analog LDO VREF Select.
#define AM_REG_MCUCTRL_LDOREG2_VREFSELANALDO_S       16
#define AM_REG_MCUCTRL_LDOREG2_VREFSELANALDO_M       0x00010000
#define AM_REG_MCUCTRL_LDOREG2_VREFSELANALDO(n)      (((uint32_t)(n) << 16) & 0x00010000)
#define AM_REG_MCUCTRL_LDOREG2_VREFSELANALDO_SELECT  0x00010000

// SRAM LDO VREF Select.
#define AM_REG_MCUCTRL_LDOREG2_VREFSELSRAMLDO_S      15
#define AM_REG_MCUCTRL_LDOREG2_VREFSELSRAMLDO_M      0x00008000
#define AM_REG_MCUCTRL_LDOREG2_VREFSELSRAMLDO(n)     (((uint32_t)(n) << 15) & 0x00008000)
#define AM_REG_MCUCTRL_LDOREG2_VREFSELSRAMLDO_SELECT 0x00008000

// Flash LDO VREF Select.
#define AM_REG_MCUCTRL_LDOREG2_VREFSELFLASHLDO_S     14
#define AM_REG_MCUCTRL_LDOREG2_VREFSELFLASHLDO_M     0x00004000
#define AM_REG_MCUCTRL_LDOREG2_VREFSELFLASHLDO(n)    (((uint32_t)(n) << 14) & 0x00004000)
#define AM_REG_MCUCTRL_LDOREG2_VREFSELFLASHLDO_SELECT 0x00004000

// Core LDO VREF Select.
#define AM_REG_MCUCTRL_LDOREG2_VREFSELCORELDO_S      13
#define AM_REG_MCUCTRL_LDOREG2_VREFSELCORELDO_M      0x00002000
#define AM_REG_MCUCTRL_LDOREG2_VREFSELCORELDO(n)     (((uint32_t)(n) << 13) & 0x00002000)
#define AM_REG_MCUCTRL_LDOREG2_VREFSELCORELDO_SELECT 0x00002000

// Analog LDO Trim.
#define AM_REG_MCUCTRL_LDOREG2_TRIMANALDO_S          9
#define AM_REG_MCUCTRL_LDOREG2_TRIMANALDO_M          0x00001E00
#define AM_REG_MCUCTRL_LDOREG2_TRIMANALDO(n)         (((uint32_t)(n) << 9) & 0x00001E00)

// SRAM LDO Trim.
#define AM_REG_MCUCTRL_LDOREG2_TRIMSRAMLDO_S         5
#define AM_REG_MCUCTRL_LDOREG2_TRIMSRAMLDO_M         0x000001E0
#define AM_REG_MCUCTRL_LDOREG2_TRIMSRAMLDO(n)        (((uint32_t)(n) << 5) & 0x000001E0)

// Mem LDO Trim.
#define AM_REG_MCUCTRL_LDOREG2_TRIMLDOMEM_S          1
#define AM_REG_MCUCTRL_LDOREG2_TRIMLDOMEM_M          0x0000001E
#define AM_REG_MCUCTRL_LDOREG2_TRIMLDOMEM(n)         (((uint32_t)(n) << 1) & 0x0000001E)

// LDO2 Software Override Enable.
#define AM_REG_MCUCTRL_LDOREG2_LDO2SWE_S             0
#define AM_REG_MCUCTRL_LDOREG2_LDO2SWE_M             0x00000001
#define AM_REG_MCUCTRL_LDOREG2_LDO2SWE(n)            (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_MCUCTRL_LDOREG2_LDO2SWE_OVERRIDE_DIS  0x00000000
#define AM_REG_MCUCTRL_LDOREG2_LDO2SWE_OVERRIDE_EN   0x00000001

#endif // MCU_VALIDATION
// #### INTERNAL END ####
// #### INTERNAL BEGIN ####
#ifdef MCU_VALIDATION
//*****************************************************************************
//
// MCUCTRL_LDOREG3 - LDO Control Register 3
//
//*****************************************************************************
// SRAM LDO Power Down.
#define AM_REG_MCUCTRL_LDOREG3_PWDSRAMLDO_S          2
#define AM_REG_MCUCTRL_LDOREG3_PWDSRAMLDO_M          0x00000004
#define AM_REG_MCUCTRL_LDOREG3_PWDSRAMLDO(n)         (((uint32_t)(n) << 2) & 0x00000004)
#define AM_REG_MCUCTRL_LDOREG3_PWDSRAMLDO_PWR_DN     0x00000004

// Bypass SRAM LDO.
#define AM_REG_MCUCTRL_LDOREG3_SLEEPSRAMLDO_S        1
#define AM_REG_MCUCTRL_LDOREG3_SLEEPSRAMLDO_M        0x00000002
#define AM_REG_MCUCTRL_LDOREG3_SLEEPSRAMLDO(n)       (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_MCUCTRL_LDOREG3_SLEEPSRAMLDO_BYPASS   0x00000002

// LDO3 Software Override Enable.
#define AM_REG_MCUCTRL_LDOREG3_LDO3SWE_S             0
#define AM_REG_MCUCTRL_LDOREG3_LDO3SWE_M             0x00000001
#define AM_REG_MCUCTRL_LDOREG3_LDO3SWE(n)            (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_MCUCTRL_LDOREG3_LDO3SWE_OVERRIDE_DIS  0x00000000
#define AM_REG_MCUCTRL_LDOREG3_LDO3SWE_OVERRIDE_EN   0x00000001

#endif // MCU_VALIDATION
// #### INTERNAL END ####
// #### INTERNAL BEGIN ####
#ifdef MCU_VALIDATION
//*****************************************************************************
//
// MCUCTRL_UNCALVREF - Uncalibrated VREF Control
//
//*****************************************************************************
// Uncalibrated vref power down
#define AM_REG_MCUCTRL_UNCALVREF_PWDUNCALVREF_S      0
#define AM_REG_MCUCTRL_UNCALVREF_PWDUNCALVREF_M      0x00000001
#define AM_REG_MCUCTRL_UNCALVREF_PWDUNCALVREF(n)     (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_MCUCTRL_UNCALVREF_PWDUNCALVREF_PWR_DN 0x00000001

#endif // MCU_VALIDATION
// #### INTERNAL END ####
// #### INTERNAL BEGIN ####
#ifdef MCU_VALIDATION
//*****************************************************************************
//
// MCUCTRL_HFRC - HFRC Control
//
//*****************************************************************************
// Default HFRC frequency tune value
#define AM_REG_MCUCTRL_HFRC_HFTUNE_S                 10
#define AM_REG_MCUCTRL_HFRC_HFTUNE_M                 0x001FFC00
#define AM_REG_MCUCTRL_HFRC_HFTUNE(n)                (((uint32_t)(n) << 10) & 0x001FFC00)

// Power Up Delay before enabling clocks.
#define AM_REG_MCUCTRL_HFRC_HFRCDEL_S                5
#define AM_REG_MCUCTRL_HFRC_HFRCDEL_M                0x000003E0
#define AM_REG_MCUCTRL_HFRC_HFRCDEL(n)               (((uint32_t)(n) << 5) & 0x000003E0)

// Power Down HFRC.
#define AM_REG_MCUCTRL_HFRC_DISABLEHFRC_S            4
#define AM_REG_MCUCTRL_HFRC_DISABLEHFRC_M            0x00000010
#define AM_REG_MCUCTRL_HFRC_DISABLEHFRC(n)           (((uint32_t)(n) << 4) & 0x00000010)
#define AM_REG_MCUCTRL_HFRC_DISABLEHFRC_PWRUP        0x00000000
#define AM_REG_MCUCTRL_HFRC_DISABLEHFRC_PWRDN        0x00000010

// Force HFRC Output Low.
#define AM_REG_MCUCTRL_HFRC_OUTLOWHFRC_S             3
#define AM_REG_MCUCTRL_HFRC_OUTLOWHFRC_M             0x00000008
#define AM_REG_MCUCTRL_HFRC_OUTLOWHFRC(n)            (((uint32_t)(n) << 3) & 0x00000008)
#define AM_REG_MCUCTRL_HFRC_OUTLOWHFRC_EN            0x00000000
#define AM_REG_MCUCTRL_HFRC_OUTLOWHFRC_OUTLOW        0x00000008

// HFRC Frequency Tune trim bits
#define AM_REG_MCUCTRL_HFRC_TRIMCOEFFHFRC_S          1
#define AM_REG_MCUCTRL_HFRC_TRIMCOEFFHFRC_M          0x00000006
#define AM_REG_MCUCTRL_HFRC_TRIMCOEFFHFRC(n)         (((uint32_t)(n) << 1) & 0x00000006)

