AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/mcu/apollo/regs/am_reg_mcuctrl.h
// HFRC Software Override Enable.
#define AM_REG_MCUCTRL_HFRC_HFRCSWE_S                0
#define AM_REG_MCUCTRL_HFRC_HFRCSWE_M                0x00000001
#define AM_REG_MCUCTRL_HFRC_HFRCSWE(n)               (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_MCUCTRL_HFRC_HFRCSWE_OVERRIDE_DIS     0x00000000
#define AM_REG_MCUCTRL_HFRC_HFRCSWE_OVERRIDE_EN      0x00000001

#endif // MCU_VALIDATION
// #### INTERNAL END ####
// #### INTERNAL BEGIN ####
#ifdef MCU_VALIDATION
//*****************************************************************************
//
// MCUCTRL_LFRC - LFRC Control
//
//*****************************************************************************
// LFRC Reset.
#define AM_REG_MCUCTRL_LFRC_RESETLFRC_S              7
#define AM_REG_MCUCTRL_LFRC_RESETLFRC_M              0x00000080
#define AM_REG_MCUCTRL_LFRC_RESETLFRC(n)             (((uint32_t)(n) << 7) & 0x00000080)
#define AM_REG_MCUCTRL_LFRC_RESETLFRC_EN             0x00000000
#define AM_REG_MCUCTRL_LFRC_RESETLFRC_RESET          0x00000080

// Power Down LFRC.
#define AM_REG_MCUCTRL_LFRC_PWDLFRC_S                6
#define AM_REG_MCUCTRL_LFRC_PWDLFRC_M                0x00000040
#define AM_REG_MCUCTRL_LFRC_PWDLFRC(n)               (((uint32_t)(n) << 6) & 0x00000040)
#define AM_REG_MCUCTRL_LFRC_PWDLFRC_PWRUP            0x00000000
#define AM_REG_MCUCTRL_LFRC_PWDLFRC_PWRDN            0x00000040

// LFRC Frequency Tune trim bits
#define AM_REG_MCUCTRL_LFRC_TRIMTUNELFRC_S           1
#define AM_REG_MCUCTRL_LFRC_TRIMTUNELFRC_M           0x0000003E
#define AM_REG_MCUCTRL_LFRC_TRIMTUNELFRC(n)          (((uint32_t)(n) << 1) & 0x0000003E)

// LFRC Software Override Enable.
#define AM_REG_MCUCTRL_LFRC_LFRCSWE_S                0
#define AM_REG_MCUCTRL_LFRC_LFRCSWE_M                0x00000001
#define AM_REG_MCUCTRL_LFRC_LFRCSWE(n)               (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_MCUCTRL_LFRC_LFRCSWE_OVERRIDE_DIS     0x00000000
#define AM_REG_MCUCTRL_LFRC_LFRCSWE_OVERRIDE_EN      0x00000001

#endif // MCU_VALIDATION
// #### INTERNAL END ####
// #### INTERNAL BEGIN ####
#ifdef MCU_VALIDATION
//*****************************************************************************
//
// MCUCTRL_IOCTRL - IO Master and Slave Control (NOT CURRENTLY USED)
//
//*****************************************************************************
// IO Master 1 Delay Value.
#define AM_REG_MCUCTRL_IOCTRL_IOM1DEL_S              6
#define AM_REG_MCUCTRL_IOCTRL_IOM1DEL_M              0x000001C0
#define AM_REG_MCUCTRL_IOCTRL_IOM1DEL(n)             (((uint32_t)(n) << 6) & 0x000001C0)

// IO Master 0 Delay Value.
#define AM_REG_MCUCTRL_IOCTRL_IOM0DEL_S              3
#define AM_REG_MCUCTRL_IOCTRL_IOM0DEL_M              0x00000038
#define AM_REG_MCUCTRL_IOCTRL_IOM0DEL(n)             (((uint32_t)(n) << 3) & 0x00000038)

// IO Slave Delay Value.
#define AM_REG_MCUCTRL_IOCTRL_IOSDEL_S               0
#define AM_REG_MCUCTRL_IOCTRL_IOSDEL_M               0x00000007
#define AM_REG_MCUCTRL_IOCTRL_IOSDEL(n)              (((uint32_t)(n) << 0) & 0x00000007)

#endif // MCU_VALIDATION
// #### INTERNAL END ####
//*****************************************************************************
//
// MCUCTRL_BANDGAPEN - Band Gap Enable
//
//*****************************************************************************
// Bandgap Enable
#define AM_REG_MCUCTRL_BANDGAPEN_BGPEN_S             0
#define AM_REG_MCUCTRL_BANDGAPEN_BGPEN_M             0x00000001
#define AM_REG_MCUCTRL_BANDGAPEN_BGPEN(n)            (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_MCUCTRL_BANDGAPEN_BGPEN_DIS           0x00000000
#define AM_REG_MCUCTRL_BANDGAPEN_BGPEN_EN            0x00000001

// #### INTERNAL BEGIN ####
#ifdef MCU_VALIDATION
//*****************************************************************************
//
// MCUCTRL_TEMPSCTRL - Temp Sensor Control
//
//*****************************************************************************
// Bandgap trim bits.
#define AM_REG_MCUCTRL_TEMPSCTRL_BGTRIM_S            4
#define AM_REG_MCUCTRL_TEMPSCTRL_BGTRIM_M            0x000000F0
#define AM_REG_MCUCTRL_TEMPSCTRL_BGTRIM(n)           (((uint32_t)(n) << 4) & 0x000000F0)

// Temperature sensor trim bits.
#define AM_REG_MCUCTRL_TEMPSCTRL_TSTRIM_S            0
#define AM_REG_MCUCTRL_TEMPSCTRL_TSTRIM_M            0x0000000F
#define AM_REG_MCUCTRL_TEMPSCTRL_TSTRIM(n)           (((uint32_t)(n) << 0) & 0x0000000F)

#endif // MCU_VALIDATION
// #### INTERNAL END ####
// #### INTERNAL BEGIN ####
#ifdef MCU_VALIDATION
//*****************************************************************************
//
// MCUCTRL_ADCPWRDLY - ADC Power Up Delay Control
//
//*****************************************************************************
// ADC IP Reference Voltage Trim.
#define AM_REG_MCUCTRL_ADCPWRDLY_ADCREFTRIM_S        16
#define AM_REG_MCUCTRL_ADCPWRDLY_ADCREFTRIM_M        0x001F0000
#define AM_REG_MCUCTRL_ADCPWRDLY_ADCREFTRIM(n)       (((uint32_t)(n) << 16) & 0x001F0000)

// ADC IP enable delay in HFRC/16 increments.
#define AM_REG_MCUCTRL_ADCPWRDLY_ADCPWR1_S           8
#define AM_REG_MCUCTRL_ADCPWRDLY_ADCPWR1_M           0x0000FF00
#define AM_REG_MCUCTRL_ADCPWRDLY_ADCPWR1(n)          (((uint32_t)(n) << 8) & 0x0000FF00)

// ADC Power Switch delay in HFRC/16 increments.
#define AM_REG_MCUCTRL_ADCPWRDLY_ADCPWR0_S           0
#define AM_REG_MCUCTRL_ADCPWRDLY_ADCPWR0_M           0x000000FF
#define AM_REG_MCUCTRL_ADCPWRDLY_ADCPWR0(n)          (((uint32_t)(n) << 0) & 0x000000FF)

#endif // MCU_VALIDATION
// #### INTERNAL END ####
// #### INTERNAL BEGIN ####
#ifdef MCU_VALIDATION
//*****************************************************************************
//
// MCUCTRL_ADCTSBGPWD - ADC Temp Sensor Bandgap Power Control
//
//*****************************************************************************
// Enable the Temp Sensor Power when set to 1 if the ADCTSBGSWE bit is set.
#define AM_REG_MCUCTRL_ADCTSBGPWD_TSPEN_S            2
#define AM_REG_MCUCTRL_ADCTSBGPWD_TSPEN_M            0x00000004
#define AM_REG_MCUCTRL_ADCTSBGPWD_TSPEN(n)           (((uint32_t)(n) << 2) & 0x00000004)
#define AM_REG_MCUCTRL_ADCTSBGPWD_TSPEN_DIS          0x00000000
#define AM_REG_MCUCTRL_ADCTSBGPWD_TSPEN_EN           0x00000004

