AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/mcu/apollo/regs/am_reg_mcuctrl.h
// Enable the ADC Power Switch on when set to 1 if the ADCTSBGSWE bit is set.
#define AM_REG_MCUCTRL_ADCTSBGPWD_ADCPSEN_S          1
#define AM_REG_MCUCTRL_ADCTSBGPWD_ADCPSEN_M          0x00000002
#define AM_REG_MCUCTRL_ADCTSBGPWD_ADCPSEN(n)         (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_MCUCTRL_ADCTSBGPWD_ADCPSEN_DIS        0x00000000
#define AM_REG_MCUCTRL_ADCTSBGPWD_ADCPSEN_EN         0x00000002

// ADC Temperature Sensor Bandgap Software Override Enable
#define AM_REG_MCUCTRL_ADCTSBGPWD_ADCTSBGSWE_S       0
#define AM_REG_MCUCTRL_ADCTSBGPWD_ADCTSBGSWE_M       0x00000001
#define AM_REG_MCUCTRL_ADCTSBGPWD_ADCTSBGSWE(n)      (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_MCUCTRL_ADCTSBGPWD_ADCTSBGSWE_OVERRIDE_DIS 0x00000000
#define AM_REG_MCUCTRL_ADCTSBGPWD_ADCTSBGSWE_OVERRIDE_EN 0x00000001

#endif // MCU_VALIDATION
// #### INTERNAL END ####
// #### INTERNAL BEGIN ####
#ifdef MCU_VALIDATION
//*****************************************************************************
//
// MCUCTRL_XTALCTRL - XTAL Oscillator Control
//
//*****************************************************************************
// XTAL Oscillator Power Down Comparator.
#define AM_REG_MCUCTRL_XTALCTRL_PWDCMPRXTAL_S        11
#define AM_REG_MCUCTRL_XTALCTRL_PWDCMPRXTAL_M        0x00000800
#define AM_REG_MCUCTRL_XTALCTRL_PWDCMPRXTAL(n)       (((uint32_t)(n) << 11) & 0x00000800)
#define AM_REG_MCUCTRL_XTALCTRL_PWDCMPRXTAL_PWRUPCOMP 0x00000000
#define AM_REG_MCUCTRL_XTALCTRL_PWDCMPRXTAL_PWRDNCOMP 0x00000800

// XTAL Oscillator Power Down Core.
#define AM_REG_MCUCTRL_XTALCTRL_PWDCOREXTAL_S        10
#define AM_REG_MCUCTRL_XTALCTRL_PWDCOREXTAL_M        0x00000400
#define AM_REG_MCUCTRL_XTALCTRL_PWDCOREXTAL(n)       (((uint32_t)(n) << 10) & 0x00000400)
#define AM_REG_MCUCTRL_XTALCTRL_PWDCOREXTAL_PWRUPCORE 0x00000000
#define AM_REG_MCUCTRL_XTALCTRL_PWDCOREXTAL_PWRDNCORE 0x00000400

// Auto-calibration delay control
#define AM_REG_MCUCTRL_XTALCTRL_ACWARMUP_S           8
#define AM_REG_MCUCTRL_XTALCTRL_ACWARMUP_M           0x00000300
#define AM_REG_MCUCTRL_XTALCTRL_ACWARMUP(n)          (((uint32_t)(n) << 8) & 0x00000300)
#define AM_REG_MCUCTRL_XTALCTRL_ACWARMUP_1SEC        0x00000000
#define AM_REG_MCUCTRL_XTALCTRL_ACWARMUP_2SEC        0x00000100
#define AM_REG_MCUCTRL_XTALCTRL_ACWARMUP_4SEC        0x00000200
#define AM_REG_MCUCTRL_XTALCTRL_ACWARMUP_8SEC        0x00000300

// XTAL Oscillator Bypass Comparator.
#define AM_REG_MCUCTRL_XTALCTRL_BYPCMPRXTAL_S        7
#define AM_REG_MCUCTRL_XTALCTRL_BYPCMPRXTAL_M        0x00000080
#define AM_REG_MCUCTRL_XTALCTRL_BYPCMPRXTAL(n)       (((uint32_t)(n) << 7) & 0x00000080)
#define AM_REG_MCUCTRL_XTALCTRL_BYPCMPRXTAL_USECOMP  0x00000000
#define AM_REG_MCUCTRL_XTALCTRL_BYPCMPRXTAL_BYPCOMP  0x00000080

// XTAL Oscillator Disable Feedback.
#define AM_REG_MCUCTRL_XTALCTRL_FDBKDSBLXTAL_S       6
#define AM_REG_MCUCTRL_XTALCTRL_FDBKDSBLXTAL_M       0x00000040
#define AM_REG_MCUCTRL_XTALCTRL_FDBKDSBLXTAL(n)      (((uint32_t)(n) << 6) & 0x00000040)
#define AM_REG_MCUCTRL_XTALCTRL_FDBKDSBLXTAL_EN      0x00000000
#define AM_REG_MCUCTRL_XTALCTRL_FDBKDSBLXTAL_DIS     0x00000040

// XTAL Oscillator Core bias trim bits
#define AM_REG_MCUCTRL_XTALCTRL_TRIMCOREBXTAL_S      1
#define AM_REG_MCUCTRL_XTALCTRL_TRIMCOREBXTAL_M      0x0000003E
#define AM_REG_MCUCTRL_XTALCTRL_TRIMCOREBXTAL(n)     (((uint32_t)(n) << 1) & 0x0000003E)

// XTAL Software Override Enable.
#define AM_REG_MCUCTRL_XTALCTRL_XTALSWE_S            0
#define AM_REG_MCUCTRL_XTALCTRL_XTALSWE_M            0x00000001
#define AM_REG_MCUCTRL_XTALCTRL_XTALSWE(n)           (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_MCUCTRL_XTALCTRL_XTALSWE_OVERRIDE_DIS 0x00000000
#define AM_REG_MCUCTRL_XTALCTRL_XTALSWE_OVERRIDE_EN  0x00000001

#endif // MCU_VALIDATION
// #### INTERNAL END ####
//*****************************************************************************
//
// MCUCTRL_SRAMPWDINSLEEP - Powerdown an SRAM Bank in Deep Sleep mode
//
//*****************************************************************************
// Force SRAM Bank 7 to powerdown in deep sleep mode, causing the contents of
// the bank to be lost.
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK7_S        7
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK7_M        0x00000080
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK7(n)       (((uint32_t)(n) << 7) & 0x00000080)
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK7_NORMAL   0x00000000
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK7_PWRDN_IN_DEEPSLEEP 0x00000080

// Force SRAM Bank 6 to powerdown in deep sleep mode, causing the contents of
// the bank to be lost.
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK6_S        6
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK6_M        0x00000040
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK6(n)       (((uint32_t)(n) << 6) & 0x00000040)
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK6_NORMAL   0x00000000
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK6_PWRDN_IN_DEEPSLEEP 0x00000040

// Force SRAM Bank 5 to powerdown in deep sleep mode, causing the contents of
// the bank to be lost.
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK5_S        5
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK5_M        0x00000020
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK5(n)       (((uint32_t)(n) << 5) & 0x00000020)
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK5_NORMAL   0x00000000
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK5_PWRDN_IN_DEEPSLEEP 0x00000020

// Force SRAM Bank 4 to powerdown in deep sleep mode, causing the contents of
// the bank to be lost.
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK4_S        4
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK4_M        0x00000010
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK4(n)       (((uint32_t)(n) << 4) & 0x00000010)
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK4_NORMAL   0x00000000
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK4_PWRDN_IN_DEEPSLEEP 0x00000010

// Force SRAM Bank 3 to powerdown in deep sleep mode, causing the contents of
// the bank to be lost.
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK3_S        3
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK3_M        0x00000008
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK3(n)       (((uint32_t)(n) << 3) & 0x00000008)
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK3_NORMAL   0x00000000
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK3_PWRDN_IN_DEEPSLEEP 0x00000008

