AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/mcu/apollo/regs/am_reg_mcuctrl.h
// Force SRAM Bank 2 to powerdown in deep sleep mode, causing the contents of
// the bank to be lost.
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK2_S        2
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK2_M        0x00000004
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK2(n)       (((uint32_t)(n) << 2) & 0x00000004)
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK2_NORMAL   0x00000000
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK2_PWRDN_IN_DEEPSLEEP 0x00000004

// Force SRAM Bank 1 to powerdown in deep sleep mode, causing the contents of
// the bank to be lost.
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK1_S        1
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK1_M        0x00000002
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK1(n)       (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK1_NORMAL   0x00000000
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK1_PWRDN_IN_DEEPSLEEP 0x00000002

// Force SRAM Bank 0 to powerdown in deep sleep mode, causing the contents of
// the bank to be lost.
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK0_S        0
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK0_M        0x00000001
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK0(n)       (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK0_NORMAL   0x00000000
#define AM_REG_MCUCTRL_SRAMPWDINSLEEP_BANK0_PWRDN_IN_DEEPSLEEP 0x00000001

//*****************************************************************************
//
// MCUCTRL_SRAMPWRDIS - Disables individual banks of the SRAM array
//
//*****************************************************************************
// Remove power from SRAM Bank 7 which will cause an access to its address space
// to generate a Hard Fault.
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK7_S            7
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK7_M            0x00000080
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK7(n)           (((uint32_t)(n) << 7) & 0x00000080)
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK7_DIS          0x00000080

// Remove power from SRAM Bank 6 which will cause an access to its address space
// to generate a Hard Fault.
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK6_S            6
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK6_M            0x00000040
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK6(n)           (((uint32_t)(n) << 6) & 0x00000040)
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK6_DIS          0x00000040

// Remove power from SRAM Bank 5 which will cause an access to its address space
// to generate a Hard Fault.
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK5_S            5
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK5_M            0x00000020
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK5(n)           (((uint32_t)(n) << 5) & 0x00000020)
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK5_DIS          0x00000020

// Remove power from SRAM Bank 4 which will cause an access to its address space
// to generate a Hard Fault.
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK4_S            4
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK4_M            0x00000010
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK4(n)           (((uint32_t)(n) << 4) & 0x00000010)
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK4_DIS          0x00000010

// Remove power from SRAM Bank 3 which will cause an access to its address space
// to generate a Hard Fault.
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK3_S            3
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK3_M            0x00000008
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK3(n)           (((uint32_t)(n) << 3) & 0x00000008)
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK3_DIS          0x00000008

// Remove power from SRAM Bank 2 which will cause an access to its address space
// to generate a Hard Fault.
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK2_S            2
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK2_M            0x00000004
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK2(n)           (((uint32_t)(n) << 2) & 0x00000004)
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK2_DIS          0x00000004

// Remove power from SRAM Bank 1 which will cause an access to its address space
// to generate a Hard Fault.
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK1_S            1
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK1_M            0x00000002
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK1(n)           (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK1_DIS          0x00000002

// Remove power from SRAM Bank 0 which will cause an access to its address space
// to generate a Hard Fault.
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK0_S            0
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK0_M            0x00000001
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK0(n)           (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_MCUCTRL_SRAMPWRDIS_BANK0_DIS          0x00000001

//*****************************************************************************
//
// MCUCTRL_FLASHPWRDIS - Disables individual banks of the Flash array
//
//*****************************************************************************
// Remove power from Flash Bank 1 which will cause an access to its address
// space to generate a Hard Fault.
#define AM_REG_MCUCTRL_FLASHPWRDIS_BANK1_S           1
#define AM_REG_MCUCTRL_FLASHPWRDIS_BANK1_M           0x00000002
#define AM_REG_MCUCTRL_FLASHPWRDIS_BANK1(n)          (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_MCUCTRL_FLASHPWRDIS_BANK1_DIS         0x00000002

// Remove power from Flash Bank 0 which will cause an access to its address
// space to generate a Hard Fault.
#define AM_REG_MCUCTRL_FLASHPWRDIS_BANK0_S           0
#define AM_REG_MCUCTRL_FLASHPWRDIS_BANK0_M           0x00000001
#define AM_REG_MCUCTRL_FLASHPWRDIS_BANK0(n)          (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_MCUCTRL_FLASHPWRDIS_BANK0_DIS         0x00000001

// #### INTERNAL BEGIN ####
#ifdef MCU_VALIDATION
//*****************************************************************************
//
// MCUCTRL_PWRONRSTDLY - Power On Sequence Delay Register
//
//*****************************************************************************
// Power On Sequence Delay 3. Aanalog stabalizing after ldo_vref_sel and
// pwd_cmp_1p8hp assertion. Increments of 32768/HFRC ns.
#define AM_REG_MCUCTRL_PWRONRSTDLY_PORDLY3_S         16
#define AM_REG_MCUCTRL_PWRONRSTDLY_PORDLY3_M         0x00FF0000
#define AM_REG_MCUCTRL_PWRONRSTDLY_PORDLY3(n)        (((uint32_t)(n) << 16) & 0x00FF0000)

// Power On Sequence Delay 2. Delay before ldo_vref_sel and pwd_cmp_1p8hp
// assertion. Increments of 32768/HFRC ns.
#define AM_REG_MCUCTRL_PWRONRSTDLY_PORDLY2_S         8
#define AM_REG_MCUCTRL_PWRONRSTDLY_PORDLY2_M         0x0000FF00
#define AM_REG_MCUCTRL_PWRONRSTDLY_PORDLY2(n)        (((uint32_t)(n) << 8) & 0x0000FF00)

// Power On Sequence Delay 1. Delay before cvrg_hs_n de-assertion. Increments of
// 32768/HFRC ns.
#define AM_REG_MCUCTRL_PWRONRSTDLY_PORDLY1_S         0
#define AM_REG_MCUCTRL_PWRONRSTDLY_PORDLY1_M         0x000000FF
#define AM_REG_MCUCTRL_PWRONRSTDLY_PORDLY1(n)        (((uint32_t)(n) << 0) & 0x000000FF)

#endif // MCU_VALIDATION
// #### INTERNAL END ####
// #### INTERNAL BEGIN ####
#ifdef MCU_VALIDATION
//*****************************************************************************
//
// MCUCTRL_PWRSEQ1ANA - Power on analog sequence1
//
//*****************************************************************************
// Calibrated Voltage Reference Generator speed mode (high speed = 0, low speed
// mode = 1)
#define AM_REG_MCUCTRL_PWRSEQ1ANA_CVRGHSN_S          1
#define AM_REG_MCUCTRL_PWRSEQ1ANA_CVRGHSN_M          0x00000002
#define AM_REG_MCUCTRL_PWRSEQ1ANA_CVRGHSN(n)         (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_MCUCTRL_PWRSEQ1ANA_CVRGHSN_HIGH       0x00000000
#define AM_REG_MCUCTRL_PWRSEQ1ANA_CVRGHSN_LOW        0x00000002

// Analog Power sequence signals Software Override Enable.
#define AM_REG_MCUCTRL_PWRSEQ1ANA_PWRSEQ1SWE_S       0
#define AM_REG_MCUCTRL_PWRSEQ1ANA_PWRSEQ1SWE_M       0x00000001
#define AM_REG_MCUCTRL_PWRSEQ1ANA_PWRSEQ1SWE(n)      (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_MCUCTRL_PWRSEQ1ANA_PWRSEQ1SWE_OVERRIDE_DIS 0x00000000
#define AM_REG_MCUCTRL_PWRSEQ1ANA_PWRSEQ1SWE_OVERRIDE_EN 0x00000001

#endif // MCU_VALIDATION
// #### INTERNAL END ####
// #### INTERNAL BEGIN ####
#ifdef MCU_VALIDATION
//*****************************************************************************
//
// MCUCTRL_PWRSEQ2ANA - Power on analog sequence2
//
//*****************************************************************************
// Select to the ALDO and CLDO to use uncalibrated (0) or calibrated (1) voltage
// reference.
#define AM_REG_MCUCTRL_PWRSEQ2ANA_LDOVREFSEL_S       1
#define AM_REG_MCUCTRL_PWRSEQ2ANA_LDOVREFSEL_M       0x00000002
#define AM_REG_MCUCTRL_PWRSEQ2ANA_LDOVREFSEL(n)      (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_MCUCTRL_PWRSEQ2ANA_LDOVREFSEL_UNCALIBRATED 0x00000000
#define AM_REG_MCUCTRL_PWRSEQ2ANA_LDOVREFSEL_CALIBRATED 0x00000002

// Analog Power sequence signals Software Override Enable.
#define AM_REG_MCUCTRL_PWRSEQ2ANA_PWRSEQ2SWE_S       0
#define AM_REG_MCUCTRL_PWRSEQ2ANA_PWRSEQ2SWE_M       0x00000001
#define AM_REG_MCUCTRL_PWRSEQ2ANA_PWRSEQ2SWE(n)      (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_MCUCTRL_PWRSEQ2ANA_PWRSEQ2SWE_OVERRIDE_DIS 0x00000000
#define AM_REG_MCUCTRL_PWRSEQ2ANA_PWRSEQ2SWE_OVERRIDE_EN 0x00000001

#endif // MCU_VALIDATION
// #### INTERNAL END ####
// #### INTERNAL BEGIN ####
#ifdef MCU_VALIDATION
//*****************************************************************************
//
// MCUCTRL_PWRSEQ3ANA - Power on analog sequence3
//
//*****************************************************************************
// reset power stable comparator power down.
#define AM_REG_MCUCTRL_PWRSEQ3ANA_PWDCMPP18HP_S      1
#define AM_REG_MCUCTRL_PWRSEQ3ANA_PWDCMPP18HP_M      0x00000002
#define AM_REG_MCUCTRL_PWRSEQ3ANA_PWDCMPP18HP(n)     (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_MCUCTRL_PWRSEQ3ANA_PWDCMPP18HP_PWR_DN 0x00000002

// Analog Power sequence signals Software Override Enable.
#define AM_REG_MCUCTRL_PWRSEQ3ANA_PWRSEQ3SWE_S       0
#define AM_REG_MCUCTRL_PWRSEQ3ANA_PWRSEQ3SWE_M       0x00000001
#define AM_REG_MCUCTRL_PWRSEQ3ANA_PWRSEQ3SWE(n)      (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_MCUCTRL_PWRSEQ3ANA_PWRSEQ3SWE_OVERRIDE_DIS 0x00000000
#define AM_REG_MCUCTRL_PWRSEQ3ANA_PWRSEQ3SWE_OVERRIDE_EN 0x00000001

#endif // MCU_VALIDATION
// #### INTERNAL END ####
// #### INTERNAL BEGIN ####
//*****************************************************************************
//
// MCUCTRL_BOOTLOADERLOW - Determines whether the bootloader code is visible at
// address 0x00000000
//
//*****************************************************************************
// Determines whether the bootloader code is visible at address 0x00000000 or
// not.
#define AM_REG_MCUCTRL_BOOTLOADERLOW_VALUE_S         0
#define AM_REG_MCUCTRL_BOOTLOADERLOW_VALUE_M         0x00000001
#define AM_REG_MCUCTRL_BOOTLOADERLOW_VALUE(n)        (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_MCUCTRL_BOOTLOADERLOW_VALUE_ADDR0     0x00000001

// #### INTERNAL END ####
// #### INTERNAL BEGIN ####
//*****************************************************************************
//
// MCUCTRL_SHADOWVALID - Register to indicate whether the shadow registers have
// been successfully loaded from the Flash Information Space.
//
//*****************************************************************************
// Indicates whether the shadow registers contain valid data from the Flash
// Information Space.
#define AM_REG_MCUCTRL_SHADOWVALID_VALID_S           0
#define AM_REG_MCUCTRL_SHADOWVALID_VALID_M           0x00000001
#define AM_REG_MCUCTRL_SHADOWVALID_VALID(n)          (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_MCUCTRL_SHADOWVALID_VALID_VALID       0x00000001

// #### INTERNAL END ####
//*****************************************************************************
//
// MCUCTRL_ICODEFAULTADDR - ICODE bus address which was present when a bus fault
// occurred.
//
//*****************************************************************************
// The ICODE bus address observed when a Bus Fault occurred. Once an address is
// captured in this field, it is held until the corresponding Fault Observed bit
// is cleared in the FAULTSTATUS register.
#define AM_REG_MCUCTRL_ICODEFAULTADDR_ADDR_S         0
#define AM_REG_MCUCTRL_ICODEFAULTADDR_ADDR_M         0xFFFFFFFF
#define AM_REG_MCUCTRL_ICODEFAULTADDR_ADDR(n)        (((uint32_t)(n) << 0) & 0xFFFFFFFF)

//*****************************************************************************
//
// MCUCTRL_DCODEFAULTADDR - DCODE bus address which was present when a bus fault
// occurred.
//
//*****************************************************************************
// The DCODE bus address observed when a Bus Fault occurred. Once an address is
// captured in this field, it is held until the corresponding Fault Observed bit
// is cleared in the FAULTSTATUS register.
#define AM_REG_MCUCTRL_DCODEFAULTADDR_ADDR_S         0
#define AM_REG_MCUCTRL_DCODEFAULTADDR_ADDR_M         0xFFFFFFFF
#define AM_REG_MCUCTRL_DCODEFAULTADDR_ADDR(n)        (((uint32_t)(n) << 0) & 0xFFFFFFFF)

//*****************************************************************************
//
// MCUCTRL_SYSFAULTADDR - System bus address which was present when a bus fault
// occurred.
//
//*****************************************************************************
// SYS bus address observed when a Bus Fault occurred. Once an address is
// captured in this field, it is held until the corresponding Fault Observed bit
// is cleared in the FAULTSTATUS register.
#define AM_REG_MCUCTRL_SYSFAULTADDR_ADDR_S           0
#define AM_REG_MCUCTRL_SYSFAULTADDR_ADDR_M           0xFFFFFFFF
#define AM_REG_MCUCTRL_SYSFAULTADDR_ADDR(n)          (((uint32_t)(n) << 0) & 0xFFFFFFFF)

//*****************************************************************************
//
// MCUCTRL_FAULTSTATUS - Reflects the status of the bus decoders' fault
// detection. Any write to this register will clear all of the status bits
// within the register.
//
//*****************************************************************************
// SYS Bus Decoder Fault Detected bit. When set, a fault has been detected, and
// the SYSFAULTADDR register will contain the bus address which generated the
// fault.
#define AM_REG_MCUCTRL_FAULTSTATUS_SYS_S             2
#define AM_REG_MCUCTRL_FAULTSTATUS_SYS_M             0x00000004
#define AM_REG_MCUCTRL_FAULTSTATUS_SYS(n)            (((uint32_t)(n) << 2) & 0x00000004)
#define AM_REG_MCUCTRL_FAULTSTATUS_SYS_NOFAULT       0x00000000
#define AM_REG_MCUCTRL_FAULTSTATUS_SYS_FAULT         0x00000004

